app/controllers/patcher_controller.rb

  def store
    if (params[:identifier].empty?)
      flash[:error] = "you must choose an identifier!"
    elsif (!StoredApuid.find_by_identifier(params[:identifier]).nil?)
      flash[:error] = "sorry, this identifier is already taken"
    else
      StoredApuid.create(:identifier => params[:identifier], :uid => session[:uid], :valid_until => Date.today + 30)
---
SELECT * FROM `stored_apuids` WHERE (`stored_apuids`.`identifier` = 0) LIMIT 1
INSERT INTO `stored_apuids` (`created_at`, `updated_at`, `uid`, `identifier`) VALUES('2009-10-29 00:39:18', '2009-10-29 00:39:18', '4910cea0a176012c9a500019db2ce30b', 'first_testing')

  def retrieve
    if(params[:identifier].empty?)
      flash[:error] = "missing identifier for retrieval"
      redirect_to :back and return
    end
    retrievedApuid = StoredApuid.find_by_identifier(params[:identifier])
    if(retrievedApuid.nil?)
      flash[:error] = "Did not find an APUID with identifier \'#{params[:identifier]}\' in the database."
      redirect_to :back and return
    end
    if (params[:commit] == PATCHER_BUTTON_LABEL)
      redirect_to :action => "download_browser_patcher", :uid => retrievedApuid.uid
    else
      redirect_to :action => "download_ff_extension", :uid => retrievedApuid.uid
    end

    retrievedApuid.destroy unless params[:leave_apuid] == "1"
---
SELECT * FROM `stored_apuids` WHERE (`stored_apuids`.`identifier` = 'asdasdsad') LIMIT 1
DELETE FROM `stored_apuids` WHERE `id` = 1